{"data":{"wordpressPage":{"title":"Bridging the Offshoring Gap: Genuine Interest and the Need for Education","content":"<div id='layer_slider_11' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_22' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://smm.callboxmarketing.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_22' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_23' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><b>The Client</b></p>\n<p>Industry: Financial Consulting<br />\nLocation: Hong Kong<br />\nHeadquarters: Hong Kong</p>\n<p><b>Campaign Type</b></p>\n<p>Appointment Setting</p>\n<p><b>Campaign Target Criteria</b></p>\n<p>Location: Hong Kong, Singapore<br />\nIndustry: Corporate services, Trust Companies, Private Bank and Wealth Management<br />\nDecision Makers: C-Levels, Business Development Managers, Directors, Marketing Directors, General Managers</p>\n<p><b>Summary</b></p>\n<p>The Client is a leading media company in Hong Kong, providing news and finance information services to financial intermediaries and high net worth individuals. The services they provide include educating Chinese financial intermediaries on the effective use of tax planning and asset management through series of summit. They work on a platform that was built from different media channels like online media, periodicals and guides to deliver the latest information and relevant topics to finance professionals.</p>\n<p><b>The Challenge</b></p>\n<p>Basically, the Client’s job is to bridge a connection between Chinese financial consultants and companies planning to bring their businesses offshore via financial conferences. These businesses could either be companies from neighboring countries in Asia like Singapore that would want to be educated on how to bring investments to Hong Kong, or Hong Kong-based companies that would like to expand their businesses to other regions.</p>\n<p>The Client prides itself in being recognized as the leading media company in Hong Kong that is able to get every financial summit they launch jampacked with attendees. The leads generated from such impressive attendance numbers, however, are a different story. Since its inception in 2010, the Client’s events have had subpar lead turnout at only 10-20% warm follow-ups and those interested to discuss further out of the total number of attendees. Others were just curious to hear what the meeting was all about and didn’t really have the <i>need for offshoring</i>.</p>\n<p>At that point, the Client realized that they needed a more <i>targeted audience</i> who have the need for <i>education on offshoring</i> and equally <i>interested to engage further </i>with their services. There was added pressure to expedite the project since a series of summits were already on the approving stage and were ready to take off anytime once scheduled were finalized..</p>\n<p>The challenge was, the Client didn’t have the proper tools and processes to use to address their need &#8211; <i>to profile their target attendees </i>and <i>gauge the need to be educated,</i> and <i>uncover the genuine interest</i> <i>for offshoring opportunities</i>.</p>\n<p><b>The Solution</b></p>\n<p>Callbox designed a multi-channel marketing campaign with the help of the Callbox Pipeline Lead Nurture Tool that fully addressed the Client’s needs. The following activities were simultaneously ran throughout the campaign duration &#8211; exerted with best effort by both Callbox and the Client.</p>\n<p><i>Customer Profiling</i></p>\n<p>Callbox’s filtered database together with the Client’s existing one were profiled by the team. Aside from updating the contact details like name, business address, phone numbers and emails, the lists were well-managed by scrubbing off DNs and revalidating bounced emails off from both lists.</p>\n<p><i>Appointment Setting</i></p>\n<p>The appointment setting campaign was rigidly rolled out as it was the main component of the whole multi-channel marketing campaign. A number of probing questions were included in the call script and required to be fully answered by prospects in order for the agent to be able to uncover important information that will qualify the call as a lead. The said questions were to gauge the prospect of the following:</p>\n<ul>\n<li>If the business has plans of expanding to other regions</li>\n<li>If the company is interested in investing in or acquiring another line of business</li>\n<li>If the organization has in depth knowledge of the business rules and processes of the region which they target to set up the business in</li>\n</ul>\n<p>Also, to enhance customer experience, the agent walked the prospects through the Client’s website to assist them with any concern like queries about the services, browsing through the summit schedules or signing up for the upcoming events.</p>\n<p><i>Reporting</i></p>\n<p>Both the Callbox team and the Client regularly convened to discuss the successes and challenges encountered in the campaign. This was the venue where specific action plans were laid down to be understood by everyone in the team and carefully structured to address challenges and even avoid repetition of the course. Aside from the regular meetings, Callbox utilized the integrated features of the Callbox Pipeline, particularly its Lead Nurture Tool to send real time updates to the Client such as appointment schedules and confirmation emails.</p>\n<p><b>The Benefits</b></p>\n<p>The multi-channel marketing campaign concluded with stellar results.<i>The Callbox team delivered 19 confirmed appointments which scored 30% turnout from the total number of attendees. These were prospects who were profiled and identified to have both the interest on offshoring and the need to be educated . In addition to the the appointments, 38 warm follow-ups </i>were prospects for confirmation of attendance whether they or their representatives will attend and there were <i>48 who requested for more information</i> &#8211; these were prospects who, with thorough probing, were identified to have the <i>need for education</i> and<i> interested in offshoring opportunities</i> but decisions were held pending due to some matters for further discussion.</p>\n<p>The leading media company was perfectly happy with the campaign turnout. With Callbox’s multi-channel marketing campaign, the Client’s list of customers were properly profiled and filtered according to <i>need</i> and<i> interest</i> in the Client’s services. The summit that included the 19 confirmed attendees produced a number of leads that were converted into current customers and are successful investors in their chosen region.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_FIN_Bridging-the-Offshoring-Gap-Genuine-Interest-and-the-Need-for-Education.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.com/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_23' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n","slug":"bridging-the-offshoring-gap-genuine-interest-and-the-need-for-education","date":"July 05, 2016"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e0c0078b-d8ad-5244-b0f0-f7b34394beb3"}}