{"data":{"wordpressPage":{"title":"Callbox: Providing Sales Support to One of the Largest Business Software Companies","content":"<div id='layer_slider_23' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_45' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://pipeline.callboxinc.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_45' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_46' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_two_fifth first  \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><h2>Customer Successes</h2>\n<ul>\n<li><a href=\"/about/customer-successes/case-studies/\">Case Studies</a></li>\n<li><a href=\"/about/customer-successes/client-testimonials/\">Client Testimonials</a></li>\n</ul>\n</div></section><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: left; margin-left: 0px;\">Find out more. Talk to our Rep.</p>\n</div></section><br />\n<div class='avia-button-wrap avia-button-left '><a href='http://www.callboxinc.co.uk/contact/' class='avia-button  avia-icon_select-no avia-color-custom avia-size-x-large avia-position-left '  style='background-color:#ffc905; border-color:#ffc905; color:#000000; ' ><span class='avia_iconbox_title' >Contact Us</span></a></div></p></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><strong>The Client</strong></p>\n<p>The Client is the world’s third largest business software company. It has branches in over 30 countries and offers a full range of enterprise business software including:</p>\n<ul>\n<li>Customer relationship management</li>\n<li>Enterprise asset management</li>\n<li>Enterprise resource planning</li>\n<li>Financial management</li>\n<li>Human capital management</li>\n<li>Performance management</li>\n<li>Product lifecycle management</li>\n<li>Supplier relationship management</li>\n<li>Supply chain management, including business specific inventory management, transportation logistics and warehouse management software</li>\n</ul>\n<p>The Client’s goal is to provide the best software experience and a lower total cost of ownership for their customers. To meet customers’ long-term needs, they provide an evolutionary path to support continuing business and technology innovation.</p>\n<p><strong>The Challenge</strong></p>\n<p>The Client didn’t have the in-house expertise to run a lead generation and lead management campaign, nor did they have the database tools to support one. To achieve their objectives, they needed a partner to develop and execute a comprehensive lead generation, qualification and appointment-setting program to capture greater market share for their business software solutions. While the company had a dominant market share in the industry, it lacked the support for their sales people to handle leads and prospect profiling.</p>\n<p>With the rapidly increasing number of individuals from various companies across all industries downloading information from the Client’s website, it was crucial for them to:</p>\n<ul>\n<li>profile and qualify all individuals using their website;</li>\n<li>strengthen their sales force capabilities in handling the profiling and qualification</li>\n</ul>\n<p>Calls had to be made across the Asia Pacific Region to verify the records of individuals and companies that downloaded files from the Client’s website. Qualification was necessary, as the Client wanted to ensure that their website visitors/prospects could be considered warm leads before their sales team pursued them. Aside from verification and qualification, the Client also needed a support team to call and invite prospects and customers to various company-sponsored events throughout Asia.</p>\n<p><strong>The Callbox Solution</strong></p>\n<p>The Client teamed up with Callbox to carry out:</p>\n<p><em>1. Lead Generation through outbound cold calling to generate leads and appointments for the Client’s sales force.</em></p>\n<p>The Client’s target market consisted of decision makers who were looking for business-specific solutions to address their challenges and produce tangible results. Callbox’s sales force used cold calling to identify and qualify prospects for the Client. Qualifying questions determined:</p>\n<ul>\n<li>Determine whether the prospects wanted to evaluate a new software solution.</li>\n<li>Determine business pains and/or areas of interest to find a fit between prospects’ needs and Client’s solution offerings.</li>\n<li>Identify the type of software prospects were using and for how long they’ve been using it.</li>\n<li>Find out if prospects would be interested if presented with a new solution.</li>\n</ul>\n<p>Callbox executed the cold-calling campaign using the list of target contacts provided by the Client. Agents who were assigned to this campaign used a customized spreadsheet to keep track of all call results. Calls were categorized as lead completed, not interested, competitor, invalid, duplicate, no action needed, etc., and were assigned to each respective column on the spreadsheet for easy reporting and evaluation. Leads generated from the calling campaign were posted on the PipelineCRM to be reviewed by the Client and feedbacks were discussed. Callbox provided daily and monthly reports on pipeline activity and campaign status.</p>\n<p><em>2. Profiling and updating the client’s prospect data base with up-to-date business and contact information</em></p>\n<p>The Client provided Callbox with their list of prospects and clients. The Callbox Team verified and updated all possible contact information by phone, including email addresses.</p>\n<p><em>3. Call-to-Invite Campaigns</em></p>\n<p>Callbox provided total sales and marketing support by carrying out several call-to-invite campaigns, inviting the Client’s customers and prospects to attend company-sponsored events in the Philippines, Indonesia, Malaysia and Singapore. The Callbox Team then followed up every call with an email. Aside from company-sponsored events, the Client also held webinars. Callbox callers invited guests to these webinars and also confirmed attendance for the Client.</p>\n<p><em>4. Online, web-based reporting across all aspects of the project, its progress, and statistics which included lead distribution and appointments set.</em></p>\n<p>The Callbox solution provided the Client with a steady, predictable flow of qualified sales opportunities as well as a systematic methodology for tracking every opportunity and evaluating sales force effectiveness.</p>\n<p>The Client has a very accurate and predictable sales pipeline. By the time the prospect was ready to truly engage with them, they already had complete information about their prospects and their companies.</p>\n<p><strong>The Results</strong></p>\n<p>With the Callbox Team averaging 2000 calls monthly, verifying contact information of current customers, qualifying prospective clients, and setting appointments for the Client’s sales team, the Client experienced a significant increase in conversion rates.</p>\n<p>Backed by Callbox’s own PipelineCRM, the Client enjoyed easy tracking and monitoring of all leads. The Client was also able to consistently improve service offerings through call recordings made available by Callbox.</p>\n<p>Since then, the Client has been renewing on a month-to-month basis with new campaigns — lead generation, call-to-invite and profiling for different types of products. Pleased with the overall performance of Callbox, the Client provides sales training for the team, conducted at the start of every campaign. The smooth integration of sales and marketing with disciplined lead management resulted in increased sales and also provided total control over the customer acquisition process.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_SW_Callbox-Providing-Sales-Support-to-One-of-the-Largest-Business-Software-Companies.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.co.uk/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_46' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n","slug":"callbox-providing-sales-support-to-one-of-the-largest-business-software-companies","date":"January 22, 2015"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b7627563-596c-51ec-9136-c54403011390"}}