{"data":{"wordpressPage":{"title":"Capturing Advertisers for Upscale Direct Mailer","content":"<div id='layer_slider_7' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_13' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://smm.callboxmarketing.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_13' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_14' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><strong>The Client</strong></p>\n<p>The Client is a $50 million direct mail company delivering upscale prospects to advertisers of high-end products and services. They link people in upscale owner-occupied homes with the products and services they desire. The Client produces and mails decks of eye-catching, full-color, glossy postcards to this highly desirable, yet difficult-to-target, demographic.</p>\n<p>Their decks reach approximately 11 million unique homes a year, an annual circulation of more than 44 million card pack impressions. More than 20,000 advertisers–from small regional businesses to large national companies–advertise through Client’s mailings.</p>\n<p>Based in Tampa, Fla., the Client has 78 franchisees in 125 markets. Its corporate offices employ 16 and approximately 270 people work for their franchises.</p>\n<p><strong>The Challenge</strong></p>\n<p>Despite its huge client base and nationwide coverage, the Client needed a partner to provide them with a steady flow of advertisers. More advertisers would mean keeping their mailings updated with the latest product and service options to affluent homeowners. With someone handling the search for advertisers, the Client could then speed up the sales cycle and focus their efforts on mailings.</p>\n<p><strong>The Callbox Solution</strong></p>\n<p>An Appointment Setting Campaign was launched to capture advertisers that catered to affluent homeowners.</p>\n<p><em>Assessment and List Preparation</em></p>\n<p>After consultations with the Client about their goals and identifying their target market, the Callbox team put their expertise to work starting with the preparation of the list of advertisers. Callbox tapped into its global database, which is home to highly targeted business contacts from all industries.</p>\n<p>Majority of the Client’s advertisers provide home-improvement products and services, such as decorating, kitchen, closet, bath, fireplace, fencing, landscaping, lighting, maintenance, roofing, painting, wall covering, and flooring. Based on the criteria given, Callbox’s in-house research team produced a customized list for the Client.</p>\n<p><em>Cold Calling and Appointment Setting</em></p>\n<p>After uploading the Clients customized list of advertisers to Callboxs PipelineCRM, the script was prepared by Callbox. Callbox agents carefully studied this script in preparation for cold-calling.</p>\n<p>Highly-trained to present products and services and competent to handle inquiries, Callbox agents successfully forwarded qualified sales leads to the Client. Upon advertiser request, agents also provided valuable additional information and walked them through the Client’s process, products, website and mailing schedules. Making over 200 calls per day, Callbox agents booked phone and face-to-face appointments one after the other and passed them to the Client’s sales team for closing.</p>\n<p><strong>The Results</strong></p>\n<p><em>Satisfied Client Refers Callbox to Over 15 Franchises</em></p>\n<p>The first of the Client’s franchises that signed up for Callbox’s Appointment Setting service was based in San Antonio, Texas. After a successful campaign, word spread about Callbox’s appointment setting expertise, and as a result, more of the Client’s franchises followed suit. The Callbox clientele grew to over 15 franchises, all referred by their fellow franchises through word of mouth.</p>\n<p>The Callbox team successfully captured the right advertisers for these franchises. The Client’s sales team had to do less cold calling and following up due to the support provided by Callbox. The Client was pleased with the Callbox teams performance and notes that 80 percent of its first-time advertisers re-signed for future mailings.</p>\n<p>With more advertisers seeking a place in Client’s scheduled direct mailings, the Client now offers advertisers added value by posting their postcards on their company website, where consumers can search for specific services and print advertisers’ postcard offerings.</p>\n<p>Today the Client remains the top direct mailer providing the highest quality services and products available. They currently mail to 11 million owner occupied homes across the nation in over one hundred major markets, and the list keeps growing.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_AD_Capturing-Advertisers-for-Upscale-Direct-Mailer.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.co.uk/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_14' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-3865'><div class='entry-content-wrapper clearfix'>\n","slug":"capturing-advertisers-for-upscale-direct-mailer","date":"January 22, 2015"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"43244dcc-a7ed-5b52-a6a9-1460180f938d"}}