{"data":{"wordpressPage":{"title":"How Callbox’s Marketing Automation Tool Accelerated Success for Singapore’s Leadership Curriculum Provider","content":"<div id='layer_slider_15' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_30' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://pipeline.callboxinc.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_30' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'></div></div></div><!-- close content main div --></div></div><div id='av_section_31' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><strong>Highlights</strong></p>\n<ul>\n<li>Seamless Call-to-Invite process, improving lead generation results by 75%</li>\n<li>Eliminated efforts on revising and sending email copies, manual call scheduling and list cleansing, added more opportune time to reach prospects</li>\n<li>Cleansed database with profiled and updated contact information, inducing data accuracy</li>\n<li>Promptly responded to real time alerts and notifications, maximizing call hours on reaching 40 plus decision makers daily</li>\n<li>Spot-on tracking of prospect’s actions on email communications, increasing lead conversion rates</li>\n</ul>\n<p><strong>Challenge</strong></p>\n<p>The Client is a Singapore partner company of a US-based Leadership Curriculum provider that promotes the world’s most advanced curriculum in leadership potentials.They conduct seminars that deliver extraordinary results for clients by combining optimization technologies, services and custom-built facilities that ensure sustained growth, fulfillment and momentum over the long-term. They were in search of a competitive telemarketing company that can maximize both staff and tools to address their need for a systematic and trackable introduction and follow up of all target contacts, and their search ended with Callbox.</p>\n<p><strong>Solution</strong></p>\n<p>In this Call-to-Invite campaign, Callbox uncovered opportunities for improvement &#8211; the database and the target contacts. Concurrent with the Callbox agent’s daily call schedule is the consistent Data Profiling for the improvement of the database by updating the contact information with current and correct data, verifying the contact details like direct line and mobile numbers, and filling up blanks like email addresses to ensure accuracy.</p>\n<p>Moreover, Callbox maximized the Pipeline&#8217;s marketing automation function via its Lead Nurture Tool to facilitate the sending out of specific email copies to prospects, notifying the caller to follow up a contact who took action on email communications, and moving invalid contacts from one list to another for validation and cleansing. To cap all these dynamic processes, a master schema of behavior-based actions was created, which fostered three effectual working concepts:</p>\n<p><b>Concept 1- Send Mail</b></p>\n<p>A sequence of emails are sent to all unique entries contained in the Target List. The call result tag in the pipeline triggers the status change in the LN Tool, and a specific email copy is automatically sent. Below is a reference of email copy with corresponding call tag:</p>\n<p><img class=\"aligncenter size-full wp-image-14591\" src=\"http://www.callboxinc.com/wp-content/uploads/2016/04/table1.png\" alt=\"table1\" width=\"498\" height=\"400\" /></p>\n<p><i>Note:</i></p>\n<p>In the event where the agent makes a follow up call and the prospect was not available or the call was directed to a voicemail, RFI and For Follow Up copies are sent subsequently.</p>\n<p>Also, if the Trigger status is unchanged and the timeframe for the Wait action lapsed, this means there wasn’t any action from the prospect, and so Intro, RFI and For Follow Up copies will be sent subsequently.</p>\n<p><b>Concept 2 &#8211; Queue as Call Priority</b></p>\n<p>A reminder for the agent to call a prospect as soon as he takes an action on email communications. This timely alert gives a better chance of converting opportunities into leads.</p>\n<p>OPENED &#8211; the prospect opened the email<br />\nCLICKED &#8211; the prospect clicked a link/s on the email copy<br />\nVISITED WEBSITE &#8211; the prospect visited the website<br />\nSUBMITTED A FORM &#8211; the prospect submitted a form (most common for call-to-invite campaigns)</p>\n<p><b>Concept 3 &#8211; </b><b>Move to List</b></p>\n<p>Moving invalid contacts from the Target List to other lists for cleansing purposes. The following lists are required entries for each schema:</p>\n<p>TARGET LIST &#8211; is the prime list of unique contacts and resource of email send outs, which the agent utilizes for calling.</p>\n<p>SUPPORT LIST &#8211; receives bounced contacts. These bounced contacts are then validated/profiled by the agent or research team and sent back to the Target List to be called.</p>\n<p>REPOSITORY LIST &#8211; Invalid contacts that were tagged as Deadline, Fax Tone, or Disconnected, contacts are moved to this list and undergo the same process as with bounces.</p>\n<p><strong>Benefits</strong></p>\n<p>Callbox’s call-to-invite campaign scheme unleashed more potentials for the Leadership Curriculum provider, leveraging on smart marketing technology and proven prospecting processes.<br />\nWith integration of Callbox’s Lead Nurture Tool, the campaign ran seamlessly. The automated behavior-based actions like sending email copies, queuing call priorities, and moving invalid contacts for list cleansing have rounded up a total of 228 registrations for 10 event campaigns, of which 79 (34%) were generated through the Lead Nurture Tool. The time and effort saved were instead utilized in making more calls to decision makers that made an upshot on the monthly average number of leads generated from 21 to 28. The Data Profiling process resulted to notable improvement on database accuracy from an average of 35% to 75%, as determined by Callbox’s List Scoring system. The Client now nurtures quality, revenue-driving leads and more potential follow up attendees for upcoming seminars in Bali, Indonesia and Bangkok, Thailand.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_ED_SG-Leadership.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.com/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_31' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'></p>\n","slug":"how-callboxs-marketing-automation-tool-accelerated-success-for-singapores-leadership-curriculum-provider","date":"April 07, 2016"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"62b6fe98-80c4-5989-bc87-f534c94772e5"}}