{"data":{"wordpressPage":{"title":"Frequently Asked Questions","content":"<div id='layer_slider_29' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_50' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://pipeline.callboxinc.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_50' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_51' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><h3><b>Frequently Asked Questions</b></h3>\n<p><b>1. What can Callbox offer us?</b><br />\nWe provide leads and potential clients by generating interest and setting appointments with your target market. These appointments can help generate additional sales for your company and provide a very positive ROI on the budget you allocate to the program.</p>\n<p><b>2. Where are you located?</b><br />\nWe are headquartered in Encino, CA and the personnel from our call centers who would be representing you will be calling from the Philippines. Our sales development representatives (SDRs) are highly trained and experienced in generating leads and appointments for your specific industry.</p>\n<p><b>3. How many SDRs would be calling for me?</b><br />\nThere will be a primary SDR working on an 8-hour shift and a back-up to make sure there is no downtime on your campaign.</p>\n<p><b>4. I&#8217;m concerned about the accent of the SDRs who&#8217;ll be representing my company. Can I talk and interview those assigned to my campaign?</b><br />\nMost SDRs have been with the company for 3 years or more, and with English being the medium of instruction in schools in the Philippines and most widely used in business, fluency in the language comes naturally. Prior to starting the campaign you will be able to listen to the representatives who will be working with you on your campaign. We could also send random sample calls on the initial days of calling, to solicit your feedback and to assure you that we are following your specifications.</p>\n<p><b>5. Since this is a technical account, how could you guarantee that those SDRs who&#8217;ll be representing us would be able to provide correct information to our prospects?</b><br />\nThe good thing about Callbox is we have specific departments that handle each vertical market. SDRs are experts in the verticals they handle; they&#8217;ve been working with similar accounts for 3 years or so and are skilled at answering questions regarding their own vertical, technical or otherwise.</p>\n<p><b>6. How will we be able to monitor the progress of our campaign?</b><br />\nWe will give you a user name and password to our Callbox Pipeline, an online tool where you can manage your leads and monitor your campaign on a real time basis.</p>\n<p><b>7. What is your success rate?</b><br />\nThe success rate varies greatly depending on the target market and complexity of the campaign. The range of number of qualified appointments we can set is generally between 15 to 20 appointments a month. Again, this is entirely dependent on the target market and individual you wish to reach. The larger the company and the higher the position of the decision maker you wish to reach, the more challenging to find and set a qualified appointment.</p>\n<p><b>8. Where do you get these potential clients/prospects?</b><br />\nWe do have our own research department who will provide you a business listing filtered according to your target market criteria and demographics. We would cold call their decision makers and introduce your products and services. If they pass the specifications you&#8217;ve provided us, then we would consider that a lead and transfer them to Callbox Pipeline which you&#8217;ll have access to.</p>\n<p><b>9. How do you know who my prospects are?</b><br />\nWe ask for your company&#8217;s target market criteria and what you want us to focus on, like type of industry, location, zip codes, and requirement in size of businesses such as revenue, employee size and number of users. You can specify if you want to target commercial or residential owners. Our research department would then filter our databases according to your specifications, scrub them against our clients&#8217; lists and submit them for your approval.</p>\n<p><b>10. Who are these people you set appointments with?</b><br />\nWe only set appointments with decision makers of the company. We both value time so we don&#8217;t like wasting it. You can provide us with the designations or positions of the people you want us to contact as it differs depending on the services you want this campaign for. We would only set up appointments with your target decision makers. And should the ones you prefer be not as receptive as we would want them to be, your project manager would suggest job titles for your approval.</p>\n</div></section></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_51' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n","slug":"frequently-asked-questions","date":"April 08, 2015"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b8b561f4-54fc-5f76-b369-f7f80e911180"}}