{"data":{"wordpressPage":{"title":"Turning Targets to Sales-Ready Leads with a 50% Shorter Lead Nurturing Cycle","content":"<div id='layer_slider_24' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_46' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://pipeline.callboxinc.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_46' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_47' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock  av_inherit_color'  style='color:#000000; '  itemprop=\"text\" ><p style=\"text-align: center;\"><strong>Callbox Multi-touch Multi-Channel Approach:</strong></p>\n<p><strong>Turning Targets to Sales-Ready Leads With a 50% </strong><strong>Shorter Lead Nurturing Cycle</strong></p>\n<p>A Callbox Multi-touch Multi-channel Campaign is essentially a Comprehensive Marketing Funnel designed to unearth opportunities from an initial list of prospects compiled from basic target demographics, and deliver them to a client as qualified, pitch-ready, warmed-up sales leads.</p>\n<p>The Callbox method combines the efficacy of highly-personalized traditional marketing communication with the intelligent efficiency of automation. In our years of experience, we have found that touches via phone and email remain to be most effective at establishing connections in the B2B world. Data from various campaigns also clearly suggests the importance of timing. Our findings on optimizing triggers and actions form the basis of our Callbox Pipeline’s design. In its latest incarnation, the Callbox Pipeline provides clients with a flexible, user-friendly platform for Lead Nurturing.</p>\n<p>This case study traces the success of a B2B client from effective utilization of Callbox’s Lead Generation and Lead Nurturing technology.</p>\n<p><strong>Client Profile</strong></p>\n<p>The client was the North America marketing manager for a software company specializing in SAP enterprise software solutions and business intelligence. The company is also an SAP consultancy with expertise in areas of SAP Implementation, Process Upgrade and Data Management. The company has roots in Canada and wanted to expand into the US market.</p>\n<p>The client was introduced to Callbox by an IT solutions business through the Callbox Referral Program. The California-based referrer company has been running a campaign targeting businesses nationwide with Callbox since January 2015.</p>\n<p>The client had worked with two other vendors for telemarketing services and three email service providers in the past. While these vendors were able to deliver basic calling and mass email services, the client needed a more efficient and comprehensive solution that could work seamlessly across both channels. Working with separate vendors for each channel left the client’s sales team the burden of coordinating campaign activities on different platforms, setting up each component of the campaigns themselves and much time spent on prequalification of leads generated.</p>\n<p>Callbox’s proposal for full service multi-touch multi-channel lead generation was found to be a more costefficient and all-inclusive alternative compared to contracting separate marketing services independently. The promise of a campaign greater than the sum of its parts and time savings on the client’s part allowing them to focus on sales efforts were part of the reasons behind the client’s decision to partner with Callbox.</p>\n<p><strong>The Target Market</strong></p>\n<p>The company wished to increase its market presence in California, New York and Texas. While the company has had customers from a wide range of industries, the client wanted to focus the campaign on the Manufacturing sector.</p>\n<p>Companies with annual sales of $1M to $500M and with 10 to 2000 employees were included in the database.</p>\n<p>C-Level executives, Directors and Managers in charge of the business’ enterprise software solution were the target decision makers.</p>\n<p>Around 1500 records for each of the three states were mined from the Callbox Data Warehouse based on these parameters.</p>\n<p><strong>Campaign Objectives</strong></p>\n<ul>\n<li>Gather information on the prospect’s setup and plans concerning their company’s enterprise software</li>\n<li>Arrange for a face-to-face or phone meeting with one of the client’s team of SAP Consultants</li>\n<li>Send out an EDM (electronic direct mail) with a link to a video showcasing the client company’s latest suite of enterprise software solutions</li>\n<li>Obtain a fully-profiled contact list for upcoming marketing efforts</li>\n</ul>\n</div></section>\n<div class=\"flex_column av_one_half first  \"></div><div class=\"flex_column av_one_half   \"><p><div style='height:250px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>Marketing funnel</strong></p>\n<p>A Callbox appointment is created when a prospect goes through the five stages of the marketing funnel (<em>see Fig. 1</em>). Our Lead Nurturing methods are designed to move as many prospects from one stage to the next, and allowed the client to obtain the most possible number of meetings.</p>\n</div></section></p></div><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><strong>Contacts</strong></p>\n<p>The Callbox Data Warehouse is comprised of over 50 million business records in over 7 countries. With the aid of our Data Specialist and our data mining tools, the client was able to zero in on the portion of this data pool that matched their market criteria.</p>\n<p><strong>Conversations</strong></p>\n<p>To begin converting inert contacts into leads, Callbox initiated a Conversation – an exchange over phone or email with a decision maker. Multiple contact attempts and pre-conversations with non-decision makers (gatekeepers, recommenders and evaluators) were often needed in order gather information on and establish contact with a decision maker. In the conversation stage, the decision maker was given a presentation of client’s offer.</p>\n<p><strong>Inquiries</strong></p>\n<p>Positive responses to a presentation were classified as inquiries. Inquiries often involved an initial request for information (brochure). Some cases required Callbox to make follow up calls and/or emails to confirm interest and check if the lead is ready to move to the next stage.</p>\n<p><strong>Qualified Leads</strong></p>\n<p>Whenever a decision maker makes a contact request to get a full presentation and/or formal proposal from the client, the lead is said to have graduated to this stage. In cases when the prospect had an immediate need and very high level of interest, the leads were converted directly into Qualified Leads from the Conversation stage.</p>\n<p><strong>Booked Appointments</strong></p>\n<p>In this stage, final preparations were made prior to endorsing the lead to the client. As required by the client’s qualifying criteria, screening questions were asked according to the approved call script. The prospect was also booked for a face-to-face or phone appointment with the client’s representative.</p>\n</div></section>\n<div class=\"flex_column av_one_half first  \"></div><div class=\"flex_column av_one_half   \"><p><div style='height:160px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>Multi-touch Multi-Channel Approach</strong></p>\n<p>Callbox effectively combined six different channels (<em>See Fig. 2</em>) to initiate contact, generate conversations and resp</p>\n</div></section></p></div><div style='height:30px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><strong>Targeted Email </strong></p>\n<p>Email copies were formulated to have attention-grabbing subject lines, brief but precise body text and compelling calls to action in order to generate the most opens and replies. A total of 15,000 initial and follow-up emails were sent via Callbox’s email system &#8212; fully equipped with open and click tracking, and KPI reporting. The campaign’s Lead Nurturing schemes relied mostly on Callbox Pipeline’s programmable email marketing triggers.</p>\n<p><strong>Calling</strong></p>\n<p>Outbound calls facilitated by Callbox’s Dialer System ensured that more than 200 live calls were made 8 hours a day, 5 days a week. Callbox Pipeline also allowed the calling agent to efficiently leave pre-recorded voicemail messages.</p>\n<p><strong>Web Visits</strong></p>\n<p>A landing page was created to complement the campaign’s outbound efforts via email and calling. Designed with professional and marketing aesthetics in mind, it featured the client’s brand and highlighted the main features of the client’s software. The landing page was also equipped with a web form to allow prospects to send in a contact request.</p>\n<p><strong>Social Media</strong></p>\n<p>Callbox Pipeline’s integrated Linkedin features allowed the Callbox team to find matching Linkedin profiles for each prospect in the contact list. Linkedin connection requests were sent to as many contacts as possible with an accompanying introduction text. Client also opted to have Callbox send out messages to all connections made as another possible avenue to generate leads.</p>\n<p><strong>Postal Mail and SMS</strong></p>\n<p>The client was one of the first to take advantage of Callbox’s supplementary snail mail and SMS capabilities. For this campaign, these channels were used to deliver promotional postcards to the prospects’ business address and send out mobile appointment reminders.</p>\n</div></section>\n<div class=\"flex_column av_one_half first  \"></div><div class=\"flex_column av_one_half   \"><p><div style='height:180px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>Nurturing Leads The Callbox Way<br />\n</strong></p>\n<p>Lead Nurturing was the key to this campaign’s efficiency and success. The client was able to take full advantage of the Callbox Pipeline’s dragand-drop Lead Nurturing suite and the Callbox team’s knowledge of multi-channel lead generation best practices</p>\n<p>Callbox Pipeline’s tools for Lead Nurturing allowed the Callbox team to maximize the campaign hours and reserve manual effort for more critical tasks (eg. presenting to decision makers, customized email response handling) and left most of the repetitive and time-sensitive legwork to automation.</p>\n</div></section></p></div><div class=\"flex_column av_one_half first  \"></div><div class=\"flex_column av_one_half   \"><p><div style='height:130px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>I. Online lead Nurturing Scheme</strong></p>\n<p>An Introduction email was sent out to all email contacts in the prospect’s list (See Fig. 3). Three follow up emails spaced five days apart were programmed to be sent out to contacts who had no opens recorded, allowing multiple opportunities to convert contacts into opens.</p>\n<p>Emails were mostly set to send out between 8:00AM to 10:00AM local time, as these were determined to be the optimal hours for email blasts based on Callbox analytics. Latter follow-up copies were set to send out at 4:00PM- 6:00PM to increase the chances of generating opens if the first attempts were unsuccessful.</p>\n</div></section></p></div><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p>Contacts who opened the email and visited the landing page were added to a Priority Call List for further nurturing by phone.</p>\n<p>Email responses and inquiries from the landing page are logged into the Callbox Pipeline and inquiries not converted into booked appointments after three days were lined up for a round of follow-up emails.</p>\n<p>By the end of the Online Lead Nurturing Cycle, all contacts with no opens recorded were also collected into another Call List, to which the Call Lead Nurturing Scheme was applied.</p>\n<p>Supplementary Flowchart:<br />\n<em>Appendix A &#8211; Online Lead Nurturing Scheme</em></p>\n<p><strong>Web Inquiries</strong></p>\n<p>Prospects were led to the landing page primarily via email sendouts. Each contact request sent in by a prospect was received by the Callbox team as an email notification and treated as in inquiry.</p>\n</div></section>\n<div class=\"flex_column av_one_half first  \"><div class='avia-image-container avia_animated_image avia_animate_when_almost_visible pop-up av-styling-no-styling  avia-align-center '  itemscope=\"itemscope\" itemtype=\"https://schema.org/ImageObject\"  ><div class='avia-image-container-inner'><img class='avia_image ' src='http://www.callboxinc.co.uk/wp-content/uploads/2015/07/Update-your-LinkedIn-Profile-for-a-Better-Lead-Generation_DONE.jpg' alt='Update your LinkedIn Profile for a Better Lead Generation' title='Update your LinkedIn Profile for a Better Lead Generation'   itemprop=\"contentURL\"  /></div></div></div><div class=\"flex_column av_one_half   \"><p><div style='height:130px' class='hr hr-invisible '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div><br />\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>II. Call Lead Nurturing Scheme</strong></p>\n<p>Automated actions under the Call Lead Nurturing Scheme (See Fig. 4) were determined by the Call Result Tag applied to the contact after each call attempt. Callbox Pipeline was programmed to send out different email copies if the call resulted in (a) no contact with a decision maker, (b) a decision maker requesting for a follow up or a (c) non-interested decision maker. Email brochures and meeting reminders were sent out automatically to all booked appointments.</p>\n<p><em>Supplementary Flowchart:</em><br />\n<em>Appendix B &#8211; Call Lead Nurturing Scheme</em></p>\n</div></section></p></div><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p style=\"text-align: center;\"><strong>Campaign Results</strong></p>\n<p><strong>Production and other KPIs</strong></p>\n<p>By the end of the campaign term, the client was averaging 12 face to face meetings and 23 phone appointments per week. The client’s sales team was able to move 82% of all appointments into proposal stage and garnered 2 closed deals within the first two weeks, generating a three-fold return from their initial investment in the Callbox campaign.</p>\n<p>Of the 15,719 emails delivered, 2247 opens (14.3%) and 193 click-throughs (1.2%) were recorded. 218 inquiries were generated out of 943 total replies received. Email marketing contributed to roughly 38% of all appointments generated while meetings from contact form inquiries comprised another 9%.</p>\n<p>Out of the 9046 records comprising the initial campaign list, 7870 records (87%) were fully profiled, complete with verified names, job titles and email addresses.</p>\n<p><em>“Both my marketing team and sales team are very happy. Marketing sits back and only has to monitor because they have done their job on the setup and almost everything is automated; while my salesforce are very busy fulfilling booked appointments.”</em> says the Client’s CEO</p>\n<p>Below is the number of Targets on each stage of the Marketing Funnel after only 12 weeks in the Callbox Multi-touch Multi-channel Lead Nurturing Campaign.</p>\n<p>With the Client’s previous telemarketing and email marketing service providers, the Client was able to convert 2% of raw targets into booked appointments only after running the campaigns for about 6.5 months or 26 weeks. Callbox cut this time into half, and significantly moved more targets into the later stages of the marketing cycle. This was enough to convince the Client to expand the number of campaigns they are running with Callbox.</p>\n<p style=\"text-align: center;\"><strong>Marketing Funnel Conversion Summary</strong></p>\n</div></section>\n\n\n<div class='avia-image-container avia_animated_image avia_animate_when_almost_visible pop-up av-styling-no-styling  avia-align-center '  itemscope=\"itemscope\" itemtype=\"https://schema.org/ImageObject\"  ><div class='avia-image-container-inner'><img class='avia_image ' src='http://www.callboxinc.com/wp-content/uploads/2015/07/Call-lead-nurturing-scheme-845x684.jpg' alt='' title=''   itemprop=\"contentURL\"  /></div></div>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_SW_Turning-Targets-to-Sales-Ready-Leads-50-Percent-Shorter-Lead-Nurturing-Cycle.pdf\" target=\"_blank\"><img class=\"size-full wp-image-3799 aligncenter\" src=\"http://www.callboxinc.com/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section>\n<div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_47' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n","slug":"turning-targets-to-sales-ready-leads-with-a-50-shorter-lead-nurturing-cycle-3","date":"July 06, 2015"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"f455b939-a0f0-5b94-9fdd-7ca43a6e2e85"}}