{"data":{"wordpressPage":{"title":"Callbox’s Three-Step Tactic To Success for Marketing Consulting Specialist","content":"<div id='layer_slider_14' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_28' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://pipeline.callboxinc.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_28' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'></div></div></div><!-- close content main div --></div></div><div id='av_section_29' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><b>The Client</b></p>\n<p>Industry: Marketing Consulting<br />\nLocation: Singapore<br />\nHeadquarters: Malaysia</p>\n<p><b>Campaign Type</b></p>\n<p>Event Marketing</p>\n<p><b>Campaign Target Criteria</b></p>\n<p>Location: Singapore &amp; Malaysia<br />\nIndustries: All industry types and sizes<br />\nDecision Makers: IT Managers / IT Admin / Helpdesk Managers / Infrastructure Managers</p>\n<p><b>Summary</b></p>\n<p>The Client is a Marketing Consulting Agency which was founded in Kuala Lumpur, Malaysia in 2002. The company is an event specialist mainly for IT and Software industries providing Signature Campaigns, Event Management, Retail Services, Partner Programmes and Content Development in Singapore, Malaysia and Indonesia, and had ran several successful events for IT giants like Intel and Microsoft.</p>\n<p>As the Client’s reputation grew in 2007, more industry giants like Bosch, Castrol, DiGi and Disney Channel entrusted them to handle major events which brought them more acclaim in the region.</p>\n<p><b>The Challenge</b></p>\n<p>The Client’s successes in the past did not leave them overconfident and content with their achievements but rather drove them to set their sights higher with plans for expansion of their services in the Southeast Asia by providing <i>service to multinational IT and software companies</i>. This objective was crystal clear but the tools and processes to run the project remained a gray area. This led the Client to look for a third party provider who possesses the expertise that would help them realize their plans. They considered partnering with a telemarketing company &#8211; specifically someone who has <b><i>rich experience in events marketing campaigns and can provide a large and well profiled database</i></b> for them.</p>\n<p>Callbox was among three providers that were shortlisted by the Client but stood out to be their best choice in the end. Find out the reason why.</p>\n<p><b>The Solution</b></p>\n<p>The Client planned out a trade event for a giant IT firm. The objective was to gather as many attendees as possible and get interested prospects who would be good targets to follow up for succeeding events.</p>\n<p>Callbox, known for its thought technology as a top lead generation provider, designed a <b><i>multi-channel marketing campaign</i></b> for the Client and employed the use of the <b><i>Callbox Pipeline Lead Nurture Tool,</i></b> a marketing automation tool that streamlines actions and communication between the Client and the targets, creating a seamless workflow for the Callbox team throughout the duration of the campaign.</p>\n<p>The presentation of the whole idea of how the project will be ran was the very reason why the Client blithely chose Callbox over the other two lead generation providers.</p>\n<p>The process was easy as counting 1-2-3:</p>\n<ol style=\"color: #000000 !important;\">\n<li>Event invitation emails were sent to prospects before the calling commenced. This was coursed through the Callbox Pipeline Lead Nurture tool which served a double purpose &#8211; to formally invite prospects and at the same time to validate the information details of the contacts in the list. The validation process filtered invalid contacts like DNC and Bounced emails by moving these entries from the target list to a repository list. Once updated, these were uploaded back to the target list to be blasted with email invites.</li>\n<li>A <i>one call resolution</i> tactic was applied in making follow-up calls to prospects who took actions like <i>opened email, replied </i>or <i>clicked a link</i> on the page upon receipt of the invites. The agent’s follow-up call was not simply to share more about the event details or answer the prospect’s queries but as much as possible, aimed to seize the lead by walking them through the whole registration process. Once done, the agent immediately sent out a calendar invite that contained complete event details like title, date and time, venue and confirmation codes as a steady reminder for the prospect.</li>\n<li>The third and last step was calling all the registrants a day or two before the event date to confirm their attendance. During the confirmation call, the agent had to make sure that the registrant had accepted or accepts the calendar invite and confirms his or his representative’s attendance to the event.</li>\n</ol>\n<p><b>The Benefits</b></p>\n<p>The campaign officially registered <b>129 confirmed attendees</b> for the giant IT company. But for this Marketing Consulting specialist, the successfully concluded campaign was just a start of even bigger things, for them the best thing was nurturing <b>150 warm follow-ups</b> who are all possible attendees to upcoming events, and a <b>rich database containing well-profiled and accurate contacts. </b></p>\n<p>The event campaign saved the Client much time and money as they not only gathered a good number of attendees for the IT giant’s event but at the same time, currently reserves another batch of warm prospects for the next event that wouldn&#8217;t necessarily require much time and effort to follow-up.<br />\nIn fact, as of press time, Callbox is set to launch another event campaign for the Client.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/Callbox-Three-Step-Tactic-Success-Marketing-Specialist.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.com/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_29' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'></p>\n","slug":"callboxs-three-step-tactic-to-success-for-marketing-consulting-specialist","date":"May 18, 2016"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"2a901658-2d37-5043-b121-f37e5b2c03d6"}}