{"data":{"wordpressPage":{"title":"Callbox: Perfect Candidate for Japan’s Chief Recruiter","content":"<div id='layer_slider_12' class='avia-layerslider main_color avia-shadow  container_wrap sidebar_right'    style='height: 471px;' ></div>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_24' class='avia-section main_color avia-section-no-padding avia-no-border-styling avia-bg-style-scroll  av-minimum-height av-minimum-height-custom container_wrap sidebar_right' style = 'background-color: #ffcc02; '  ><div class='container' style='height:150px'><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><center><iframe class=\"iframetbox\" src=\"http://smm.callboxmarketing.com/client_commendation/index-enfold.php\" width=\"100%\" height=\"100\" frameborder=\"0\" scrolling=\"no\" align=\"middle\"></iframe></center></p>\n</div></section>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_24' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n</div></div></div><!-- close content main div --></div></div><div id='av_section_25' class='avia-section main_color avia-section-default avia-no-shadow avia-bg-style-scroll  container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n<div class=\"flex_column av_one_fifth first  \"></div><div class=\"flex_column av_three_fifth   \"><section class=\"av_textblock_section\"  itemscope=\"itemscope\" itemtype=\"https://schema.org/CreativeWork\" ><div class='avia_textblock '   itemprop=\"text\" ><p><b>The Client</b></p>\n<p>Industry: Recruitment/Staffing<br />\nProduct/Service: Recruitment<br />\nLocation: Tokyo, Japan<br />\nHeadquarters: Tokyo, ,Japan</p>\n<p><b>Campaign Type</b></p>\n<p>Appointment Setting (Office Appointment)</p>\n<p><b>Campaign Target Criteria</b></p>\n<p><b>Campaign 1:</b></p>\n<p>Location: Houston, New York, Singapore, Hong Kong, Australia and UK<br />\nIndustries: All industries except recruitment and employment agencies and job boards companies<br />\nDecision makers: HR Manager, HR Director, CEOs, Recruitment Managers<br />\nBusiness Size: 10 to 100 Employees</p>\n<p><b>Campaign 2:</b></p>\n<p>Location: Singapore<br />\nIndustries: All industries except recruitment and employment agencies and job boards companies<br />\nDecision makers: HR Manager, HR Director, CEOs, Recruitment Managers<br />\nBusiness Size: 10 to 200 Employees</p>\n<p><b>Summary</b></p>\n<p>The Client is Japan’s largest recruiting and information Service Company. They are focused on supporting a diverse range of work style though offering a wide variety of services including job advertisements, permanent placement services, temporary staffing services, outsourcing services, pre organization-related services, and development-related services in an effort to help realize a world in which people can freely choose their own unique work style.</p>\n<p>The Client also provides a broad range of services for companies, from employee recruitment to development and assignment. Through their diverse services, they are committed to offering the best HR solutions for business operations.</p>\n<p><b>The Challenge</b></p>\n<p>The Client was planning to launch a new product in Singapore and they didn’t have a marketing team to help them engage with customers. Hoping to reach out to prospects and meeting their deadline, the Client decided to outsource to a company that specializes in reaching new markets and has all the marketing tools including database, email support and social media to manage a campaign and help generate potential clients for them<b>.</b></p>\n<p><b>The Solution</b></p>\n<p><b>1</b><b>st</b><b> Campaign:</b></p>\n<p>Before the campaign commenced, the Client highlighted how crucial it is for them to reach their target prospects for the launch of their product. Prior to signing up with Callbox, the Client had planned a marketing strategy of their own, which was focused on different target locations per week. They decided to apply this strategy to their first Callbox campaign.</p>\n<p>Contacts were profiled properly and were sent out an email. To get more interested prospects, the team needed a sustained and focused effort. However, despite much effort exerted by the team, the Client’s marketing strategy gave them less time to nurture their warm prospects, which resulted to failure in meeting the Client’s campaign expectations.</p>\n<p><img class=\"aligncenter size-full wp-image-15758\" src=\"http://www.callboxinc.com/wp-content/uploads/2016/07/table1.png\" alt=\"table1\" width=\"462\" height=\"511\" /></p>\n<p>The Client assessed the results and the team provided their feedback on the campaign as well. After evaluating the campaign, the Client and the Callbox team came to the following conclusions.</p>\n<ul>\n<li>Jumping from one target area to another from week to week gave them less time to reach out to the right people. The availability of prospects had to be put into consideration as well.</li>\n<li>Having limited time to run the campaign affected the conversion rate. Many prospects considered looking into the product, however, most of them didn’t want to commit yet.</li>\n<li>Right timing is the key. Running a 3-week campaign on a lean month, when most of the prospects were on vacation, contributed to a lower-than-expected turnout..</li>\n</ul>\n<p><b>2</b><b>nd</b><b> Campaign:</b></p>\n<p>Having learned much from the initial campaign and armed with insights on how they can make improvements, the Callbox team, together with the Client, made some changes to help improve the campaign’s performance. In order to address the Client’s challenge of reaching out to prospects before the official launch of their product, the team implemented the following:</p>\n<ul>\n<li><i><i>Callbox’s multi-channel approach, whereby the team sent out emails to warm prospects prior to the start of the campaign which helped generates positive replies and was converted to appointments. At the same time, the team tried different approaches to touch base and follow up with them while running the campaign.</i></i></li>\n</ul>\n<ul>\n<li><i>The Client ran a 2-week campaign, this time with 4 agents focusing on one location. The team conducted regular status meetings with the Client to provide updates and keep track of their course of action. </i></li>\n</ul>\n<p>With the help of the Callbox Pipeline Lead Nurture Tool, the team was able to create a scheme and set a timeline that helped achieve the desired results within the time frame specified by the Client.</p>\n<p>Callbox’s multi-channel approach played an important role which resulted to higher number of appointments at the end of 2nd term:</p>\n<p><img class=\"aligncenter size-full wp-image-15757\" src=\"http://www.callboxinc.com/wp-content/uploads/2016/07/table2.png\" alt=\"table2\" width=\"461\" height=\"306\" /></p>\n<p><i>Before the end of the campaign, the client commended the team for their effort, “99% no cancellation of appointments. Only 1% of the appointment was cancelled because of double booking.”</i></p>\n<p><b>The Benefits</b></p>\n<p>With Callbox’s experience and the team’s expertise in troubleshooting different types of campaigns, together with the Client, they managed to create a customized program to meet the Client’s target and expectations.</p>\n<p><b>Running a multi-channel</b> <b>marketing campaign</b> with the aid of the <b>Callbox’s Pipeline Lead Nurture Tool</b>, the team managed to deliver a higher number of qualified appointments than they would have without it. As a result, the Client decided not to accept more office appointments and advised the team to convert them to leads instead as they no longer have enough people to handle all appointments delivered.</p>\n<p>Currently, the Client is nurturing 178 leads, 37 of which are interested with the product and agreed to meet with the Client’s sales team, 75 warm leads who are interested to know more about the product and 66 leads which can be followed up through email. These impressive results prompted the Client to signify his intention to sign up for a long term contract by the 3rd quarter of this year.</p>\n<p><a href=\"http://www.callboxinc.co.uk/external/casestudies/CS_OTH_Callbox-Perfect-Candidate-for-Japan-Chief-Recruiter.pdf\" target=\"_blank\"><img class=\"alignleft size-full wp-image-3799\" src=\"http://www.callboxinc.com/wp-content/uploads/2015/01/download_pdf.gif\" alt=\"download_pdf\" width=\"108\" height=\"59\" /></a></p>\n</div></section></div><div  class='hr hr-full hr-no-shadow '><span class='hr-inner ' ><span class='hr-inner-style'></span></span></div>\n</div></div></div><!-- close content main div --></div></div><div id='after_section_25' class='main_color container_wrap sidebar_right'   ><div class='container' ><div class='template-page content  av-content-small alpha units'><div class='post-entry post-entry-type-page post-entry-24686'><div class='entry-content-wrapper clearfix'>\n","slug":"callbox-perfect-candidate-for-japans-chief-recruiter","date":"July 05, 2016"},"site":{"id":"Site","siteMetadata":{"title":"Gatsby Default Starter"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"f977cb81-3126-5e63-aadc-19afc0dc9cdf"}}